# Directcontext3dApplicationId Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..Directcontext3dApplicationId Property
ParameterTypeId Class See Also
---
"ApplicationId"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId Directcontext3dApplicationId { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property Directcontext3dApplicationId As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ Directcontext3dApplicationId {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace